import numpy as np

# 1] 배열의 인덱싱
x = np.array([10,20,30,40,50])
print(x[0]) # 10
print(x[-2]) # 40
print(x[[0 , 2]]) # [10 , 30] # , [[ 특정인덱스 , 특정인덱스]]
print( x[ x > 20 ] )# [ 논리조건 ] # [30 40 50]

# 2] 2차원 인덱싱
x = np.array( [ [ 1,2,3] , [4,5,6] , [7,8,9] ] )
print( x[ 0 , 0 ] ) # 0 행 0 열 # 1
print( x[ 1 , 2 ] ) # 1 행 2 열 # 6
print( x[ -1 , -1 ] ) # 마지막 행 마지막 열 # 9
print( x [ x >5 ] ) # [6 7 8 9]

# 3] 슬라이싱
x = np.array([10,20,30,40,50])
print( x[ 1 : 4 ] ) # [20 30 40]
print( x[ : 3 ] ) # 시작인덱스 생략시 0  # [10 20 30]
print( x[ -3 : ] ) # 끝인덱스 생략시 마지막인덱스 # [30 40 50]
print( x[ : : 2 ]) # [10 30 50]

# 4] 2차원 슬라이싱
x = np.array( [ [ 1,2,3] , [4,5,6] , [7,8,9] ] )
# print(x [행슬라이싱 , 열슬라이싱])
print( x[ : , 1]) # [2 5 8] # 행 : 전체 ,  열 1 # [2 5 8]
print( x[ 1 , : ] ) # 행 :1 행 , 열 : 전체 # [ 4 5 6]
print( x[ 0:2 , 1:3] ) # [[2 3] [5 6]] ** / 열 혹은 행이 해당 배열보다 크더라도 인덱스 에러는 발생하지 않음.  (Python과 다른 점)

# 5] 슬라이싱 주의할점 : 
x = np.array([10,20,30,40,50])
y = x[ 1 : 4] # [20 30 40] # 주소참조형식 
y[0] = 100
print(x) # 원본 확인 했더니 , 원본도 같이 변경됨. 
y2 = x[1:4].copy() # 슬라이싱에서 비파괴적으로 작성하려면 , .copy()로 하여 작성
y2[0]= 1000
print(x)

# 6] 배열의연산
x = np.array( [1,2,3] )
y = np.array( [4,5,6] )
print( x + y ) # 같은 위치끼리 더함 # [5 7 9]
print ( x * y ) # [ 4 10 18]
print ( x ** 2 ) #  [1 4 9]
print ( x - 2 )  # [ -1 0 1]
print(np.sqrt(x)) # 제곱근 , 루트 [1.         1.41421356 1.73205081]
print( x > 2 ) # [False False  True]
print( ( x > 1) & (x < 3) ) # (조건1) & (조건2) #AND  [False  True False]
print( ( x ==1 ) | ( x ==3 ) ) # (조건1) | (조건2) # OR    [ True False  True]
print ( x > y) # 같은 위치끼리 비교연산 # [False False False]

# 배열 간 비교/연산 : 같은 위치끼리 연산 / 비교
# 스칼라(단일숫자) 와 배열 비교/연산 : TRUE or FALSE 또는 결과